#language: ru
  Функционал: Домашняя работа Ozone
    Сценарий: Сценарий 1 для домашней работы
      * Выполните поиск по "iphone"
      * Ограничить поле "Цена" до "60000"
      * Отметить чекбокс "Высокий рейтинг"
      * Отметить чекбокс "3 ГБ"
      * Добавить в корзину первые "8" нечетных
      * Перейти в корзину
      * Добавить отчет
      * Сравнить наличие товаров в корзине
      * Сравнить количество товаров в корзине
      * Удалить все товары из корзины
      * Проверить что корзина пуста


    Сценарий: Сценарий 2 для домашней работы
      * Выполните поиск по "беспроводные наушники"
      * Ограничить поле "Цена" до "10000"
      * Выбрать бренд "Beats"
      * Выбрать бренд "Samsung"
      * Отметить чекбокс "Высокий рейтинг"
      * Добавить в корзину первые "8" четных
      * Перейти в корзину
      * Добавить отчет
      * Сравнить наличие товаров в корзине
      * Сравнить количество товаров в корзине
      * Удалить все товары из корзины
      * Проверить что корзина пуста
